# BackgroundImageFit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageBackgroundSettings..::..BackgroundImageFit Property
ImageBackgroundSettings Class See Also
---
The background image fit type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public BackgroundImageFit BackgroundImageFit { get; set; }
```

Visual Basic
---
```text
Public Property BackgroundImageFit As BackgroundImageFit
	Get
	Set
```

Visual C++
---
```text
public:
property BackgroundImageFit BackgroundImageFit {
	BackgroundImageFit get ();
	void set (BackgroundImageFit value);
}
```

# Remarks
This value indicates how scale should be applied to the image in order to fit it to a page or screen.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ImageBackgroundSettings Class
Autodesk.Revit.DB Namespace